app/controllers/courses_controller.rb

SELECT * FROM "courses" WHERE ("courses"."id" = 1)
---
  def show
    @course = Course.find(params[:id])

SELECT * FROM "courses" WHERE ("courses"."id" = 30)
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO "courses" ("name", "updated_at", "description", "created_at") VALUES(NULL, '2009-11-13 12:36:24.043385', NULL, '2009-11-13 12:36:24.043385') RETURNING "id"
---
  def create
    @course = Course.new(params[:course])

    if @course.save