app/controllers/course_instances_controller.rb

  def show
    @ci = CourseInstance.find(params[:id])
---
SELECT * FROM "course_instances" WHERE ("course_instances"."id" = 2)